artillery-final-test.yml
# artillery-final-test.yml
# VERSÃO FINAL - Usa o arquivo .cjs (CommonJS)

config:
  # Alvo: Seu servidor
  target: "http://localhost:3020" # <-- CONFIRME SUA PORTA
  
  # 1. CARREGAR O NOSSO ARQUIVO JAVASCRIPT (.cjs)
  # (Ele deve estar na mesma pasta deste .yml)
  processor: "./artillery-helpers.cjs"

  # Carga: 5 usuários/seg por 30 segundos
  phases:
    - duration: 30
      arrivalRate: 5

scenarios:
  - flow:
      # 2. CHAMAR AS FUNÇÕES JS ANTES DO POST
      # Estas funções criam as variáveis {{ randomEmail }} e {{ randomCnpj }}
      - function: "generateRandomEmail"
      - function: "generateRandomCnpj"
      
      # 3. FAZER O POST
      - post:
          url: "/cadastro"
          
          formData:
            # Campos de Texto Padrão
            nome_creche: "Creche Teste (CJS)"
            senha: "senha123"
            confirmar_senha: "senha123"
            terms: "on"
            telefone: "11987654321"
            cep: "01001000"
            rua: "Rua do Teste"
            bairro: "Bairro CJS"
            cidade: "Cidade Teste"
            
            # --- CORREÇÃO COM JS ---
            # Usando as variáveis que o nosso JS criou
            email: "{{ randomEmail }}"
            cnpj: "{{ randomCnpj }}"

          # Esperamos 201 (Created)
          expect:
            - statusCode: 201